app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)
    @song.playlist_id = params[:playlist_id]

    if @song.save
---
INSERT INTO "songs" ("title", "artist", "time", "created_at", "updated_at", "playlist_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Be Our Guest"], ["artist", "Lumiere"], ["time", "2:35"], ["created_at", "2021-02-26 16:30:22.358022"], ["updated_at", "2021-02-26 16:30:22.358022"], ["playlist_id", 1]]

  def update
    if @song.update(song_params)
---
UPDATE "songs" SET "artist" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["artist", "Coggsworth"], ["updated_at", "2021-02-26 16:51:26.860858"], ["id", 16]]